ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_PWMXBAR_CONTROLSS_502D1000h.xml
<module name="CONTROLSS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_PWMXBAR_STATUS" acronym="CONTROLSS_PWMXBAR_STATUS" offset="16" width="32" description="Output Signal Status.">
		<bitfield id="PWMXBAR_STATUS_STS" width="30" begin="29" end="0" resetval="0x0" description="Output Signal Status" range="29:0" rwaccess="R"/>
	</register><register id="CONTROLSS_PWMXBAR_FLAGINVERT" acronym="CONTROLSS_PWMXBAR_FLAGINVERT" offset="20" width="32" description="Output Signal Invert Before Latch.">
		<bitfield id="PWMXBAR_FLAGINVERT_INVERT" width="30" begin="29" end="0" resetval="0x0" description="Output Signal Invert Before Latch" range="29:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR_FLAG" acronym="CONTROLSS_PWMXBAR_FLAG" offset="24" width="32" description="Output Signal Latched Flag.">
		<bitfield id="PWMXBAR_FLAG_BIT29" width="1" begin="29" end="29" resetval="0x0" description="Output Signal Latched Flag" range="29" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT28" width="1" begin="28" end="28" resetval="0x0" description="Output Signal Latched Flag" range="28" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT27" width="1" begin="27" end="27" resetval="0x0" description="Output Signal Latched Flag" range="27" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT26" width="1" begin="26" end="26" resetval="0x0" description="Output Signal Latched Flag" range="26" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT25" width="1" begin="25" end="25" resetval="0x0" description="Output Signal Latched Flag" range="25" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT24" width="1" begin="24" end="24" resetval="0x0" description="Output Signal Latched Flag" range="24" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT23" width="1" begin="23" end="23" resetval="0x0" description="Output Signal Latched Flag" range="23" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT22" width="1" begin="22" end="22" resetval="0x0" description="Output Signal Latched Flag" range="22" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT21" width="1" begin="21" end="21" resetval="0x0" description="Output Signal Latched Flag" range="21" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT20" width="1" begin="20" end="20" resetval="0x0" description="Output Signal Latched Flag" range="20" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT19" width="1" begin="19" end="19" resetval="0x0" description="Output Signal Latched Flag" range="19" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT18" width="1" begin="18" end="18" resetval="0x0" description="Output Signal Latched Flag" range="18" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT17" width="1" begin="17" end="17" resetval="0x0" description="Output Signal Latched Flag" range="17" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT16" width="1" begin="16" end="16" resetval="0x0" description="Output Signal Latched Flag" range="16" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT15" width="1" begin="15" end="15" resetval="0x0" description="Output Signal Latched Flag" range="15" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT14" width="1" begin="14" end="14" resetval="0x0" description="Output Signal Latched Flag" range="14" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT13" width="1" begin="13" end="13" resetval="0x0" description="Output Signal Latched Flag" range="13" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT12" width="1" begin="12" end="12" resetval="0x0" description="Output Signal Latched Flag" range="12" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT11" width="1" begin="11" end="11" resetval="0x0" description="Output Signal Latched Flag" range="11" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT10" width="1" begin="10" end="10" resetval="0x0" description="Output Signal Latched Flag" range="10" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT9" width="1" begin="9" end="9" resetval="0x0" description="Output Signal Latched Flag" range="9" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT8" width="1" begin="8" end="8" resetval="0x0" description="Output Signal Latched Flag" range="8" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT7" width="1" begin="7" end="7" resetval="0x0" description="Output Signal Latched Flag" range="7" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT6" width="1" begin="6" end="6" resetval="0x0" description="Output Signal Latched Flag" range="6" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT5" width="1" begin="5" end="5" resetval="0x0" description="Output Signal Latched Flag" range="5" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT4" width="1" begin="4" end="4" resetval="0x0" description="Output Signal Latched Flag" range="4" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT3" width="1" begin="3" end="3" resetval="0x0" description="Output Signal Latched Flag" range="3" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT2" width="1" begin="2" end="2" resetval="0x0" description="Output Signal Latched Flag" range="2" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT1" width="1" begin="1" end="1" resetval="0x0" description="Output Signal Latched Flag" range="1" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_BIT0" width="1" begin="0" end="0" resetval="0x0" description="Output Signal Latched Flag" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR_FLAG_CLR" acronym="CONTROLSS_PWMXBAR_FLAG_CLR" offset="28" width="32" description="Output Signal Latched Flag Clear.">
		<bitfield id="PWMXBAR_FLAG_CLR_BIT29" width="1" begin="29" end="29" resetval="0x0" description="Output Signal Latched Flag Clear" range="29" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT28" width="1" begin="28" end="28" resetval="0x0" description="Output Signal Latched Flag Clear" range="28" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT27" width="1" begin="27" end="27" resetval="0x0" description="Output Signal Latched Flag Clear" range="27" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT26" width="1" begin="26" end="26" resetval="0x0" description="Output Signal Latched Flag Clear" range="26" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT25" width="1" begin="25" end="25" resetval="0x0" description="Output Signal Latched Flag Clear" range="25" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT24" width="1" begin="24" end="24" resetval="0x0" description="Output Signal Latched Flag Clear" range="24" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT23" width="1" begin="23" end="23" resetval="0x0" description="Output Signal Latched Flag Clear" range="23" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT22" width="1" begin="22" end="22" resetval="0x0" description="Output Signal Latched Flag Clear" range="22" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT21" width="1" begin="21" end="21" resetval="0x0" description="Output Signal Latched Flag Clear" range="21" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT20" width="1" begin="20" end="20" resetval="0x0" description="Output Signal Latched Flag Clear" range="20" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT19" width="1" begin="19" end="19" resetval="0x0" description="Output Signal Latched Flag Clear" range="19" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT18" width="1" begin="18" end="18" resetval="0x0" description="Output Signal Latched Flag Clear" range="18" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT17" width="1" begin="17" end="17" resetval="0x0" description="Output Signal Latched Flag Clear" range="17" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT16" width="1" begin="16" end="16" resetval="0x0" description="Output Signal Latched Flag Clear" range="16" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT15" width="1" begin="15" end="15" resetval="0x0" description="Output Signal Latched Flag Clear" range="15" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT14" width="1" begin="14" end="14" resetval="0x0" description="Output Signal Latched Flag Clear" range="14" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT13" width="1" begin="13" end="13" resetval="0x0" description="Output Signal Latched Flag Clear" range="13" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT12" width="1" begin="12" end="12" resetval="0x0" description="Output Signal Latched Flag Clear" range="12" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT11" width="1" begin="11" end="11" resetval="0x0" description="Output Signal Latched Flag Clear" range="11" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT10" width="1" begin="10" end="10" resetval="0x0" description="Output Signal Latched Flag Clear" range="10" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT9" width="1" begin="9" end="9" resetval="0x0" description="Output Signal Latched Flag Clear" range="9" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT8" width="1" begin="8" end="8" resetval="0x0" description="Output Signal Latched Flag Clear" range="8" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT7" width="1" begin="7" end="7" resetval="0x0" description="Output Signal Latched Flag Clear" range="7" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT6" width="1" begin="6" end="6" resetval="0x0" description="Output Signal Latched Flag Clear" range="6" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT5" width="1" begin="5" end="5" resetval="0x0" description="Output Signal Latched Flag Clear" range="5" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT4" width="1" begin="4" end="4" resetval="0x0" description="Output Signal Latched Flag Clear" range="4" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT3" width="1" begin="3" end="3" resetval="0x0" description="Output Signal Latched Flag Clear" range="3" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT2" width="1" begin="2" end="2" resetval="0x0" description="Output Signal Latched Flag Clear" range="2" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT1" width="1" begin="1" end="1" resetval="0x0" description="Output Signal Latched Flag Clear" range="1" rwaccess="R/W"/>
	<bitfield id="PWMXBAR_FLAG_CLR_BIT0" width="1" begin="0" end="0" resetval="0x0" description="Output Signal Latched Flag Clear" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR0_G0" acronym="CONTROLSS_PWMXBAR0_G0" offset="256" width="32" description="PWM XBAR 0 Input Select.">
		<bitfield id="PWMXBAR0_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR0 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR0_G1" acronym="CONTROLSS_PWMXBAR0_G1" offset="260" width="32" description="PWM XBAR 0 Input Select.">
		<bitfield id="PWMXBAR0_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR0 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR0_G2" acronym="CONTROLSS_PWMXBAR0_G2" offset="264" width="32" description="PWM XBAR 0 Input Select.">
		<bitfield id="PWMXBAR0_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR0 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR0_G3" acronym="CONTROLSS_PWMXBAR0_G3" offset="268" width="32" description="PWM XBAR 0 Input Select.">
		<bitfield id="PWMXBAR0_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR0 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR0_G4" acronym="CONTROLSS_PWMXBAR0_G4" offset="272" width="32" description="PWM XBAR 0 Input Select.">
		<bitfield id="PWMXBAR0_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR0 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR0_G5" acronym="CONTROLSS_PWMXBAR0_G5" offset="276" width="32" description="PWM XBAR 0 Input Select.">
		<bitfield id="PWMXBAR0_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR0 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR0_G6" acronym="CONTROLSS_PWMXBAR0_G6" offset="280" width="32" description="PWM XBAR 0 Input Select.">
		<bitfield id="PWMXBAR0_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR0 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR0_G7" acronym="CONTROLSS_PWMXBAR0_G7" offset="284" width="32" description="PWM XBAR 0 Input Select.">
		<bitfield id="PWMXBAR0_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR0 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR0_G8" acronym="CONTROLSS_PWMXBAR0_G8" offset="288" width="32" description="PWM XBAR 0 Input Select.">
		<bitfield id="PWMXBAR0_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR0 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR0_G9" acronym="CONTROLSS_PWMXBAR0_G9" offset="292" width="32" description="PWM XBAR 0 Input Select.">
		<bitfield id="PWMXBAR0_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR0 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR1_G0" acronym="CONTROLSS_PWMXBAR1_G0" offset="320" width="32" description="PWM XBAR 1 Input Select.">
		<bitfield id="PWMXBAR1_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR1 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR1_G1" acronym="CONTROLSS_PWMXBAR1_G1" offset="324" width="32" description="PWM XBAR 1 Input Select.">
		<bitfield id="PWMXBAR1_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR1 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR1_G2" acronym="CONTROLSS_PWMXBAR1_G2" offset="328" width="32" description="PWM XBAR 1 Input Select.">
		<bitfield id="PWMXBAR1_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR1 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR1_G3" acronym="CONTROLSS_PWMXBAR1_G3" offset="332" width="32" description="PWM XBAR 1 Input Select.">
		<bitfield id="PWMXBAR1_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR1 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR1_G4" acronym="CONTROLSS_PWMXBAR1_G4" offset="336" width="32" description="PWM XBAR 1 Input Select.">
		<bitfield id="PWMXBAR1_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR1 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR1_G5" acronym="CONTROLSS_PWMXBAR1_G5" offset="340" width="32" description="PWM XBAR 1 Input Select.">
		<bitfield id="PWMXBAR1_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR1 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR1_G6" acronym="CONTROLSS_PWMXBAR1_G6" offset="344" width="32" description="PWM XBAR 1 Input Select.">
		<bitfield id="PWMXBAR1_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR1 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR1_G7" acronym="CONTROLSS_PWMXBAR1_G7" offset="348" width="32" description="PWM XBAR 1 Input Select.">
		<bitfield id="PWMXBAR1_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR1 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR1_G8" acronym="CONTROLSS_PWMXBAR1_G8" offset="352" width="32" description="PWM XBAR 1 Input Select.">
		<bitfield id="PWMXBAR1_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR1 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4 3119:ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR1_G9" acronym="CONTROLSS_PWMXBAR1_G9" offset="356" width="32" description="PWM XBAR 1 Input Select.">
		<bitfield id="PWMXBAR1_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR1 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR2_G0" acronym="CONTROLSS_PWMXBAR2_G0" offset="384" width="32" description="PWM XBAR 2 Input Select.">
		<bitfield id="PWMXBAR2_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR2 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR2_G1" acronym="CONTROLSS_PWMXBAR2_G1" offset="388" width="32" description="PWM XBAR 2 Input Select.">
		<bitfield id="PWMXBAR2_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR2 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR2_G2" acronym="CONTROLSS_PWMXBAR2_G2" offset="392" width="32" description="PWM XBAR 2 Input Select.">
		<bitfield id="PWMXBAR2_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR2 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR2_G3" acronym="CONTROLSS_PWMXBAR2_G3" offset="396" width="32" description="PWM XBAR 2 Input Select.">
		<bitfield id="PWMXBAR2_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR2 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR2_G4" acronym="CONTROLSS_PWMXBAR2_G4" offset="400" width="32" description="PWM XBAR 2 Input Select.">
