ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_PWMXBAR_CONTROLSS_502D1000h.xml
		<bitfield id="PWMXBAR2_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR2 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR2_G5" acronym="CONTROLSS_PWMXBAR2_G5" offset="404" width="32" description="PWM XBAR 2 Input Select.">
		<bitfield id="PWMXBAR2_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR2 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR2_G6" acronym="CONTROLSS_PWMXBAR2_G6" offset="408" width="32" description="PWM XBAR 2 Input Select.">
		<bitfield id="PWMXBAR2_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR2 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR2_G7" acronym="CONTROLSS_PWMXBAR2_G7" offset="412" width="32" description="PWM XBAR 2 Input Select.">
		<bitfield id="PWMXBAR2_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR2 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR2_G8" acronym="CONTROLSS_PWMXBAR2_G8" offset="416" width="32" description="PWM XBAR 2 Input Select.">
		<bitfield id="PWMXBAR2_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR2 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR2_G9" acronym="CONTROLSS_PWMXBAR2_G9" offset="420" width="32" description="PWM XBAR 2 Input Select.">
		<bitfield id="PWMXBAR2_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR2 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G0" acronym="CONTROLSS_PWMXBAR3_G0" offset="448" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR3 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G1" acronym="CONTROLSS_PWMXBAR3_G1" offset="452" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR3 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G2" acronym="CONTROLSS_PWMXBAR3_G2" offset="456" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR3 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G3" acronym="CONTROLSS_PWMXBAR3_G3" offset="460" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR3 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G4" acronym="CONTROLSS_PWMXBAR3_G4" offset="464" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR3 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G5" acronym="CONTROLSS_PWMXBAR3_G5" offset="468" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR3 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G6" acronym="CONTROLSS_PWMXBAR3_G6" offset="472" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR3 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G7" acronym="CONTROLSS_PWMXBAR3_G7" offset="476" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR3 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G8" acronym="CONTROLSS_PWMXBAR3_G8" offset="480" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR3 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G9" acronym="CONTROLSS_PWMXBAR3_G9" offset="484" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR3 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G0" acronym="CONTROLSS_PWMXBAR4_G0" offset="512" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR4 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G1" acronym="CONTROLSS_PWMXBAR4_G1" offset="516" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR4 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G2" acronym="CONTROLSS_PWMXBAR4_G2" offset="520" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR4 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G3" acronym="CONTROLSS_PWMXBAR4_G3" offset="524" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR4 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G4" acronym="CONTROLSS_PWMXBAR4_G4" offset="528" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR4 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G5" acronym="CONTROLSS_PWMXBAR4_G5" offset="532" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR4 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G6" acronym="CONTROLSS_PWMXBAR4_G6" offset="536" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR4 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G7" acronym="CONTROLSS_PWMXBAR4_G7" offset="540" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR4 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G8" acronym="CONTROLSS_PWMXBAR4_G8" offset="544" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR4 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G9" acronym="CONTROLSS_PWMXBAR4_G9" offset="548" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR4 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G0" acronym="CONTROLSS_PWMXBAR5_G0" offset="576" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR5 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G1" acronym="CONTROLSS_PWMXBAR5_G1" offset="580" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR5 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G2" acronym="CONTROLSS_PWMXBAR5_G2" offset="584" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR5 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G3" acronym="CONTROLSS_PWMXBAR5_G3" offset="588" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR5 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G4" acronym="CONTROLSS_PWMXBAR5_G4" offset="592" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR5 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G5" acronym="CONTROLSS_PWMXBAR5_G5" offset="596" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR5 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G6" acronym="CONTROLSS_PWMXBAR5_G6" offset="600" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR5 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G7" acronym="CONTROLSS_PWMXBAR5_G7" offset="604" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR5 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G8" acronym="CONTROLSS_PWMXBAR5_G8" offset="608" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR5 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G9" acronym="CONTROLSS_PWMXBAR5_G9" offset="612" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR5 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G0" acronym="CONTROLSS_PWMXBAR6_G0" offset="640" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR6 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G1" acronym="CONTROLSS_PWMXBAR6_G1" offset="644" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR6 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G2" acronym="CONTROLSS_PWMXBAR6_G2" offset="648" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR6 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G3" acronym="CONTROLSS_PWMXBAR6_G3" offset="652" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR6 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G4" acronym="CONTROLSS_PWMXBAR6_G4" offset="656" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR6 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G5" acronym="CONTROLSS_PWMXBAR6_G5" offset="660" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR6 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G6" acronym="CONTROLSS_PWMXBAR6_G6" offset="664" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR6 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G7" acronym="CONTROLSS_PWMXBAR6_G7" offset="668" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR6 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G8" acronym="CONTROLSS_PWMXBAR6_G8" offset="672" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR6 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G9" acronym="CONTROLSS_PWMXBAR6_G9" offset="676" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR6 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G0" acronym="CONTROLSS_PWMXBAR7_G0" offset="704" width="32" description="PWM XBAR 7 Input Select.">
