ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_PWMXBAR_CONTROLSS_502D1000h.xml
		<bitfield id="PWMXBAR7_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR7 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G1" acronym="CONTROLSS_PWMXBAR7_G1" offset="708" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR7 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G2" acronym="CONTROLSS_PWMXBAR7_G2" offset="712" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR7 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G3" acronym="CONTROLSS_PWMXBAR7_G3" offset="716" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR7 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G4" acronym="CONTROLSS_PWMXBAR7_G4" offset="720" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR7 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G5" acronym="CONTROLSS_PWMXBAR7_G5" offset="724" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR7 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G6" acronym="CONTROLSS_PWMXBAR7_G6" offset="728" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR7 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G7" acronym="CONTROLSS_PWMXBAR7_G7" offset="732" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR7 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G8" acronym="CONTROLSS_PWMXBAR7_G8" offset="736" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR7 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G9" acronym="CONTROLSS_PWMXBAR7_G9" offset="740" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR7 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G0" acronym="CONTROLSS_PWMXBAR8_G0" offset="768" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR8 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G1" acronym="CONTROLSS_PWMXBAR8_G1" offset="772" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR8 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G2" acronym="CONTROLSS_PWMXBAR8_G2" offset="776" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR8 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G3" acronym="CONTROLSS_PWMXBAR8_G3" offset="780" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR8 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G4" acronym="CONTROLSS_PWMXBAR8_G4" offset="784" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR8 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G5" acronym="CONTROLSS_PWMXBAR8_G5" offset="788" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR8 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G6" acronym="CONTROLSS_PWMXBAR8_G6" offset="792" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR8 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G7" acronym="CONTROLSS_PWMXBAR8_G7" offset="796" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR8 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G8" acronym="CONTROLSS_PWMXBAR8_G8" offset="800" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR8 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G9" acronym="CONTROLSS_PWMXBAR8_G9" offset="804" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR8 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G0" acronym="CONTROLSS_PWMXBAR9_G0" offset="832" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR9 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G1" acronym="CONTROLSS_PWMXBAR9_G1" offset="836" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR9 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G2" acronym="CONTROLSS_PWMXBAR9_G2" offset="840" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR9 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G3" acronym="CONTROLSS_PWMXBAR9_G3" offset="844" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR9 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G4" acronym="CONTROLSS_PWMXBAR9_G4" offset="848" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR9 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G5" acronym="CONTROLSS_PWMXBAR9_G5" offset="852" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR9 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G6" acronym="CONTROLSS_PWMXBAR9_G6" offset="856" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR9 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G7" acronym="CONTROLSS_PWMXBAR9_G7" offset="860" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR9 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G8" acronym="CONTROLSS_PWMXBAR9_G8" offset="864" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR9 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G9" acronym="CONTROLSS_PWMXBAR9_G9" offset="868" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR9 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G0" acronym="CONTROLSS_PWMXBAR10_G0" offset="896" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR10 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G1" acronym="CONTROLSS_PWMXBAR10_G1" offset="900" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR10 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G2" acronym="CONTROLSS_PWMXBAR10_G2" offset="904" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR10 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G3" acronym="CONTROLSS_PWMXBAR10_G3" offset="908" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR10 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G4" acronym="CONTROLSS_PWMXBAR10_G4" offset="912" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR10 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G5" acronym="CONTROLSS_PWMXBAR10_G5" offset="916" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR10 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G6" acronym="CONTROLSS_PWMXBAR10_G6" offset="920" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR10 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G7" acronym="CONTROLSS_PWMXBAR10_G7" offset="924" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR10 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G8" acronym="CONTROLSS_PWMXBAR10_G8" offset="928" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR10 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G9" acronym="CONTROLSS_PWMXBAR10_G9" offset="932" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR10 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G0" acronym="CONTROLSS_PWMXBAR11_G0" offset="960" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR11 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G1" acronym="CONTROLSS_PWMXBAR11_G1" offset="964" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR11 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G2" acronym="CONTROLSS_PWMXBAR11_G2" offset="968" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR11 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G3" acronym="CONTROLSS_PWMXBAR11_G3" offset="972" width="32" description="PWM XBAR 11 Input Select.">
