ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_PWMXBAR_CONTROLSS_502D1000h.xml
		<bitfield id="PWMXBAR11_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR11 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G4" acronym="CONTROLSS_PWMXBAR11_G4" offset="976" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR11 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G5" acronym="CONTROLSS_PWMXBAR11_G5" offset="980" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR11 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G6" acronym="CONTROLSS_PWMXBAR11_G6" offset="984" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR11 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G7" acronym="CONTROLSS_PWMXBAR11_G7" offset="988" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR11 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G8" acronym="CONTROLSS_PWMXBAR11_G8" offset="992" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR11 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G9" acronym="CONTROLSS_PWMXBAR11_G9" offset="996" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR11 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G0" acronym="CONTROLSS_PWMXBAR12_G0" offset="1024" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR12 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G1" acronym="CONTROLSS_PWMXBAR12_G1" offset="1028" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR12 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G2" acronym="CONTROLSS_PWMXBAR12_G2" offset="1032" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR12 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G3" acronym="CONTROLSS_PWMXBAR12_G3" offset="1036" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR12 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G4" acronym="CONTROLSS_PWMXBAR12_G4" offset="1040" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR12 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G5" acronym="CONTROLSS_PWMXBAR12_G5" offset="1044" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR12 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G6" acronym="CONTROLSS_PWMXBAR12_G6" offset="1048" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR12 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G7" acronym="CONTROLSS_PWMXBAR12_G7" offset="1052" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR12 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G8" acronym="CONTROLSS_PWMXBAR12_G8" offset="1056" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR12 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G9" acronym="CONTROLSS_PWMXBAR12_G9" offset="1060" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR12 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G0" acronym="CONTROLSS_PWMXBAR13_G0" offset="1088" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR13 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G1" acronym="CONTROLSS_PWMXBAR13_G1" offset="1092" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR13 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G2" acronym="CONTROLSS_PWMXBAR13_G2" offset="1096" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR13 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G3" acronym="CONTROLSS_PWMXBAR13_G3" offset="1100" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR13 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G4" acronym="CONTROLSS_PWMXBAR13_G4" offset="1104" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR13 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G5" acronym="CONTROLSS_PWMXBAR13_G5" offset="1108" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR13 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G6" acronym="CONTROLSS_PWMXBAR13_G6" offset="1112" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR13 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G7" acronym="CONTROLSS_PWMXBAR13_G7" offset="1116" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR13 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G8" acronym="CONTROLSS_PWMXBAR13_G8" offset="1120" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR13 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G9" acronym="CONTROLSS_PWMXBAR13_G9" offset="1124" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR13 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G0" acronym="CONTROLSS_PWMXBAR14_G0" offset="1152" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR14 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G1" acronym="CONTROLSS_PWMXBAR14_G1" offset="1156" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR14 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G2" acronym="CONTROLSS_PWMXBAR14_G2" offset="1160" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR14 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G3" acronym="CONTROLSS_PWMXBAR14_G3" offset="1164" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR14 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G4" acronym="CONTROLSS_PWMXBAR14_G4" offset="1168" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR14 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G5" acronym="CONTROLSS_PWMXBAR14_G5" offset="1172" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR14 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G6" acronym="CONTROLSS_PWMXBAR14_G6" offset="1176" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR14 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G7" acronym="CONTROLSS_PWMXBAR14_G7" offset="1180" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR14 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G8" acronym="CONTROLSS_PWMXBAR14_G8" offset="1184" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR14 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G9" acronym="CONTROLSS_PWMXBAR14_G9" offset="1188" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR14 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G0" acronym="CONTROLSS_PWMXBAR15_G0" offset="1216" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR15 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G1" acronym="CONTROLSS_PWMXBAR15_G1" offset="1220" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR15 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G2" acronym="CONTROLSS_PWMXBAR15_G2" offset="1224" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR15 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G3" acronym="CONTROLSS_PWMXBAR15_G3" offset="1228" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR15 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G4" acronym="CONTROLSS_PWMXBAR15_G4" offset="1232" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR15 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G5" acronym="CONTROLSS_PWMXBAR15_G5" offset="1236" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR15 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G6" acronym="CONTROLSS_PWMXBAR15_G6" offset="1240" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR15 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G7" acronym="CONTROLSS_PWMXBAR15_G7" offset="1244" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR15 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
