ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_PWMXBAR_CONTROLSS_502D1000h.xml
	</register><register id="CONTROLSS_PWMXBAR15_G8" acronym="CONTROLSS_PWMXBAR15_G8" offset="1248" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR15 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G9" acronym="CONTROLSS_PWMXBAR15_G9" offset="1252" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR15 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G0" acronym="CONTROLSS_PWMXBAR16_G0" offset="1280" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR16 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G1" acronym="CONTROLSS_PWMXBAR16_G1" offset="1284" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR16 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G2" acronym="CONTROLSS_PWMXBAR16_G2" offset="1288" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR16 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G3" acronym="CONTROLSS_PWMXBAR16_G3" offset="1292" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR16 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G4" acronym="CONTROLSS_PWMXBAR16_G4" offset="1296" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR16 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G5" acronym="CONTROLSS_PWMXBAR16_G5" offset="1300" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR16 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G6" acronym="CONTROLSS_PWMXBAR16_G6" offset="1304" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR16 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G7" acronym="CONTROLSS_PWMXBAR16_G7" offset="1308" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR16 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G8" acronym="CONTROLSS_PWMXBAR16_G8" offset="1312" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR16 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G9" acronym="CONTROLSS_PWMXBAR16_G9" offset="1316" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR16 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G0" acronym="CONTROLSS_PWMXBAR17_G0" offset="1344" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR17 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G1" acronym="CONTROLSS_PWMXBAR17_G1" offset="1348" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR17 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G2" acronym="CONTROLSS_PWMXBAR17_G2" offset="1352" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR17 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G3" acronym="CONTROLSS_PWMXBAR17_G3" offset="1356" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR17 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G4" acronym="CONTROLSS_PWMXBAR17_G4" offset="1360" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR17 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G5" acronym="CONTROLSS_PWMXBAR17_G5" offset="1364" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR17 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G6" acronym="CONTROLSS_PWMXBAR17_G6" offset="1368" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR17 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G7" acronym="CONTROLSS_PWMXBAR17_G7" offset="1372" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR17 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G8" acronym="CONTROLSS_PWMXBAR17_G8" offset="1376" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR17 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G9" acronym="CONTROLSS_PWMXBAR17_G9" offset="1380" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR17 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G0" acronym="CONTROLSS_PWMXBAR18_G0" offset="1408" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR18 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G1" acronym="CONTROLSS_PWMXBAR18_G1" offset="1412" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR18 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G2" acronym="CONTROLSS_PWMXBAR18_G2" offset="1416" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR18 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G3" acronym="CONTROLSS_PWMXBAR18_G3" offset="1420" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR18 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G4" acronym="CONTROLSS_PWMXBAR18_G4" offset="1424" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR18 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G5" acronym="CONTROLSS_PWMXBAR18_G5" offset="1428" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR18 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G6" acronym="CONTROLSS_PWMXBAR18_G6" offset="1432" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR18 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G7" acronym="CONTROLSS_PWMXBAR18_G7" offset="1436" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR18 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G8" acronym="CONTROLSS_PWMXBAR18_G8" offset="1440" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR18 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G9" acronym="CONTROLSS_PWMXBAR18_G9" offset="1444" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR18 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G0" acronym="CONTROLSS_PWMXBAR19_G0" offset="1472" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR19 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G1" acronym="CONTROLSS_PWMXBAR19_G1" offset="1476" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR19 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G2" acronym="CONTROLSS_PWMXBAR19_G2" offset="1480" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR19 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G3" acronym="CONTROLSS_PWMXBAR19_G3" offset="1484" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR19 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G4" acronym="CONTROLSS_PWMXBAR19_G4" offset="1488" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR19 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G5" acronym="CONTROLSS_PWMXBAR19_G5" offset="1492" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR19 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G6" acronym="CONTROLSS_PWMXBAR19_G6" offset="1496" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR19 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G7" acronym="CONTROLSS_PWMXBAR19_G7" offset="1500" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR19 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G8" acronym="CONTROLSS_PWMXBAR19_G8" offset="1504" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR19 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G9" acronym="CONTROLSS_PWMXBAR19_G9" offset="1508" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR19 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G0" acronym="CONTROLSS_PWMXBAR20_G0" offset="1536" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR20 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G1" acronym="CONTROLSS_PWMXBAR20_G1" offset="1540" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR20 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
