ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_PWMXBAR_CONTROLSS_502D1000h.xml
	</register><register id="CONTROLSS_PWMXBAR20_G2" acronym="CONTROLSS_PWMXBAR20_G2" offset="1544" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR20 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G3" acronym="CONTROLSS_PWMXBAR20_G3" offset="1548" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR20 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G4" acronym="CONTROLSS_PWMXBAR20_G4" offset="1552" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR20 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G5" acronym="CONTROLSS_PWMXBAR20_G5" offset="1556" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR20 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G6" acronym="CONTROLSS_PWMXBAR20_G6" offset="1560" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR20 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G7" acronym="CONTROLSS_PWMXBAR20_G7" offset="1564" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR20 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G8" acronym="CONTROLSS_PWMXBAR20_G8" offset="1568" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR20 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G9" acronym="CONTROLSS_PWMXBAR20_G9" offset="1572" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR20 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G0" acronym="CONTROLSS_PWMXBAR21_G0" offset="1600" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR21 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G1" acronym="CONTROLSS_PWMXBAR21_G1" offset="1604" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR21 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G2" acronym="CONTROLSS_PWMXBAR21_G2" offset="1608" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR21 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G3" acronym="CONTROLSS_PWMXBAR21_G3" offset="1612" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR21 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G4" acronym="CONTROLSS_PWMXBAR21_G4" offset="1616" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR21 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G5" acronym="CONTROLSS_PWMXBAR21_G5" offset="1620" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR21 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G6" acronym="CONTROLSS_PWMXBAR21_G6" offset="1624" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR21 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G7" acronym="CONTROLSS_PWMXBAR21_G7" offset="1628" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR21 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G8" acronym="CONTROLSS_PWMXBAR21_G8" offset="1632" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR21 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G9" acronym="CONTROLSS_PWMXBAR21_G9" offset="1636" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR21 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G0" acronym="CONTROLSS_PWMXBAR22_G0" offset="1664" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR22 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G1" acronym="CONTROLSS_PWMXBAR22_G1" offset="1668" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR22 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G2" acronym="CONTROLSS_PWMXBAR22_G2" offset="1672" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR22 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G3" acronym="CONTROLSS_PWMXBAR22_G3" offset="1676" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR22 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G4" acronym="CONTROLSS_PWMXBAR22_G4" offset="1680" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR22 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G5" acronym="CONTROLSS_PWMXBAR22_G5" offset="1684" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR22 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G6" acronym="CONTROLSS_PWMXBAR22_G6" offset="1688" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR22 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G7" acronym="CONTROLSS_PWMXBAR22_G7" offset="1692" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR22 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G8" acronym="CONTROLSS_PWMXBAR22_G8" offset="1696" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR22 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G9" acronym="CONTROLSS_PWMXBAR22_G9" offset="1700" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR22 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G0" acronym="CONTROLSS_PWMXBAR23_G0" offset="1728" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR23 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G1" acronym="CONTROLSS_PWMXBAR23_G1" offset="1732" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR23 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G2" acronym="CONTROLSS_PWMXBAR23_G2" offset="1736" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR23 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G3" acronym="CONTROLSS_PWMXBAR23_G3" offset="1740" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR23 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G4" acronym="CONTROLSS_PWMXBAR23_G4" offset="1744" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR23 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G5" acronym="CONTROLSS_PWMXBAR23_G5" offset="1748" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR23 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G6" acronym="CONTROLSS_PWMXBAR23_G6" offset="1752" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR23 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G7" acronym="CONTROLSS_PWMXBAR23_G7" offset="1756" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR23 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G8" acronym="CONTROLSS_PWMXBAR23_G8" offset="1760" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR23 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G9" acronym="CONTROLSS_PWMXBAR23_G9" offset="1764" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR23 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G0" acronym="CONTROLSS_PWMXBAR24_G0" offset="1792" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR24 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G1" acronym="CONTROLSS_PWMXBAR24_G1" offset="1796" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR24 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G2" acronym="CONTROLSS_PWMXBAR24_G2" offset="1800" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR24 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G3" acronym="CONTROLSS_PWMXBAR24_G3" offset="1804" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR24 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G4" acronym="CONTROLSS_PWMXBAR24_G4" offset="1808" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR24 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G5" acronym="CONTROLSS_PWMXBAR24_G5" offset="1812" width="32" description="PWM XBAR 24 Input Select.">
