ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_PWMXBAR_CONTROLSS_502D1000h.xml
		<bitfield id="PWMXBAR24_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR24 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G6" acronym="CONTROLSS_PWMXBAR24_G6" offset="1816" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR24 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G7" acronym="CONTROLSS_PWMXBAR24_G7" offset="1820" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR24 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G8" acronym="CONTROLSS_PWMXBAR24_G8" offset="1824" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR24 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G9" acronym="CONTROLSS_PWMXBAR24_G9" offset="1828" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR24 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G0" acronym="CONTROLSS_PWMXBAR25_G0" offset="1856" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR25 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G1" acronym="CONTROLSS_PWMXBAR25_G1" offset="1860" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR25 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G2" acronym="CONTROLSS_PWMXBAR25_G2" offset="1864" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR25 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G3" acronym="CONTROLSS_PWMXBAR25_G3" offset="1868" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR25 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G4" acronym="CONTROLSS_PWMXBAR25_G4" offset="1872" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR25 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G5" acronym="CONTROLSS_PWMXBAR25_G5" offset="1876" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR25 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G6" acronym="CONTROLSS_PWMXBAR25_G6" offset="1880" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR25 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G7" acronym="CONTROLSS_PWMXBAR25_G7" offset="1884" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR25 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G8" acronym="CONTROLSS_PWMXBAR25_G8" offset="1888" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR25 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G9" acronym="CONTROLSS_PWMXBAR25_G9" offset="1892" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR25 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G0" acronym="CONTROLSS_PWMXBAR26_G0" offset="1920" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR26 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G1" acronym="CONTROLSS_PWMXBAR26_G1" offset="1924" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR26 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G2" acronym="CONTROLSS_PWMXBAR26_G2" offset="1928" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR26 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G3" acronym="CONTROLSS_PWMXBAR26_G3" offset="1932" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR26 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G4" acronym="CONTROLSS_PWMXBAR26_G4" offset="1936" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR26 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G5" acronym="CONTROLSS_PWMXBAR26_G5" offset="1940" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR26 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G6" acronym="CONTROLSS_PWMXBAR26_G6" offset="1944" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR26 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G7" acronym="CONTROLSS_PWMXBAR26_G7" offset="1948" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR26 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G8" acronym="CONTROLSS_PWMXBAR26_G8" offset="1952" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR26 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G9" acronym="CONTROLSS_PWMXBAR26_G9" offset="1956" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR26 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G0" acronym="CONTROLSS_PWMXBAR27_G0" offset="1984" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR27 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G1" acronym="CONTROLSS_PWMXBAR27_G1" offset="1988" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR27 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G2" acronym="CONTROLSS_PWMXBAR27_G2" offset="1992" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR27 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G3" acronym="CONTROLSS_PWMXBAR27_G3" offset="1996" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR27 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G4" acronym="CONTROLSS_PWMXBAR27_G4" offset="2000" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR27 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G5" acronym="CONTROLSS_PWMXBAR27_G5" offset="2004" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR27 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G6" acronym="CONTROLSS_PWMXBAR27_G6" offset="2008" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR27 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G7" acronym="CONTROLSS_PWMXBAR27_G7" offset="2012" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR27 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G8" acronym="CONTROLSS_PWMXBAR27_G8" offset="2016" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR27 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G9" acronym="CONTROLSS_PWMXBAR27_G9" offset="2020" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR27 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G0" acronym="CONTROLSS_PWMXBAR28_G0" offset="2048" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR28 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G1" acronym="CONTROLSS_PWMXBAR28_G1" offset="2052" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR28 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G2" acronym="CONTROLSS_PWMXBAR28_G2" offset="2056" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR28 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G3" acronym="CONTROLSS_PWMXBAR28_G3" offset="2060" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR28 G3 Input SelectBit1:ADC0.EVT2Bit2:ADC0.EVT3Bit3:ADC0.EVT4Bit4:ADC1.EVT1Bit5:ADC1.EVT2Bit6:ADC1.EVT3Bit7:ADC1.EVT4Bit8:ADC2.EVT1Bit9:ADC2.EVT2Bit10:ADC2.EVT3Bit11:ADC2.EVT4Bit12:ADC3.EVT1Bit13:ADC3.EVT2Bit14:ADC3.EVT3Bit15:ADC3.EVT4Bit16:ADC4.EVT1Bit17:ADC4.EVT2Bit18:ADC4.EVT3Bit19:ADC4.EVT4 Bit20:ADCR0.EVT1Bit21:ADCR0.EVT2Bit22:ADCR0.EVT3Bit23:ADCR0.EVT4Bit24:ADCR1.EVT1Bit25:ADCR1.EVT2Bit26:ADCR1.EVT3Bit27:ADCR1.EVT4 Bit [31:28]: ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G4" acronym="CONTROLSS_PWMXBAR28_G4" offset="2064" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR28 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G5" acronym="CONTROLSS_PWMXBAR28_G5" offset="2068" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR28 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G6" acronym="CONTROLSS_PWMXBAR28_G6" offset="2072" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR28 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G7" acronym="CONTROLSS_PWMXBAR28_G7" offset="2076" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR28 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G8" acronym="CONTROLSS_PWMXBAR28_G8" offset="2080" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR28 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G9" acronym="CONTROLSS_PWMXBAR28_G9" offset="2084" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR28 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR29_G0" acronym="CONTROLSS_PWMXBAR29_G0" offset="2112" width="32" description="PWM XBAR 29 Input Select.">
