ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_PWMXBAR_CONTROLSS_502D1000h.xml
		<bitfield id="PWMXBAR29_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR29 G0 Input SelectBit0:CMP12SS0.CTRIPLBit1:CMP12SS0.CTRIPHBit2:CMP12SS1.CTRIPLBit3:CMP12SS1.CTRIPHBit4:CMP12SS2.CTRIPLBit5:CMP12SS2.CTRIPHBit6:CMP12SS3.CTRIPLBit7:CMP12SS3.CTRIPHBit8:CMP12SS4.CTRIPLBit9:CMP12SS4.CTRIPHBit10:CMP12SS5.CTRIPLBit11:CMP12SS5.CTRIPHBit12:CMP12SS6.CTRIPLBit13:CMP12SS6.CTRIPHBit14:CMP12SS7.CTRIPLBit15:CMP12SS7.CTRIPHBit16:CMP12SS8.CTRIPLBit17:CMP12SS8.CTRIPHBit18:CMP12SS9.CTRIPLBit19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR29_G1" acronym="CONTROLSS_PWMXBAR29_G1" offset="2116" width="32" description="PWM XBAR 29 Input Select.">
		<bitfield id="PWMXBAR29_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR29 G1 Input SelectBit0:CMP8SS0.CTRIPLBit1:CMP8SS0.CTRIPHBit2:CMP8SS1.CTRIPLBit3:CMP8SS1.CTRIPHBit4:CMP8SS2.CTRIPLBit5:CMP8SS2.CTRIPHBit6:CMP8SS3.CTRIPLBit7:CMP8SS3.CTRIPHBit8:CMP8SS4.CTRIPLBit9:CMP8SS4.CTRIPHBit10:CMP8SS5.CTRIPLBit11:CMP8SS5.CTRIPHBit12:CMP8SS6.CTRIPLBit13:CMP8SS6.CTRIPHBit14:CMP8SS7.CTRIPLBit15:CMP8SS7.CTRIPHBit16:CMP8SS8.CTRIPLBit17:CMP8SS8.CTRIPHBit18:CMP8SS9.CTRIPLBit19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR29_G2" acronym="CONTROLSS_PWMXBAR29_G2" offset="2120" width="32" description="PWM XBAR 29 Input Select.">
		<bitfield id="PWMXBAR29_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR29 G2 Input SelectBit0:SDFM0.FILT1CEVT1Bit1:SDFM0.FILT1CEVT2Bit2:SDFM0.FILT1COMPHZBit3:SDFM0.FILT2CEVT1Bit4:SDFM0.FILT2CEVT2Bit5:SDFM0.FILT2COMPHZBit6:SDFM0.FILT3CEVT1Bit7:SDFM0.FILT3CEVT2Bit8:SDFM0.FILT3COMPHZBit9:SDFM0.FILT4CEVT1Bit10:SDFM0.FILT4CEVT2Bit11:SDFM0.FILT4COMPHZBit12:SDFM1.FILT1CEVT1Bit13:SDFM1.FILT1CEVT2Bit14:SDFM1.FILT1COMPHZBit15:SDFM1.FILT2CEVT1Bit16:SDFM1.FILT2CEVT2Bit17:SDFM1.FILT2COMPHZBit18:SDFM1.FILT3CEVT1Bit19:SDFM1.FILT3CEVT2Bit20:SDFM1.FILT3COMPHZBit21:SDFM1.FILT4CEVT1Bit22:SDFM1.FILT4CEVT2Bit23:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR29_G3" acronym="CONTROLSS_PWMXBAR29_G3" offset="2124" width="32" description="PWM XBAR 29 Input Select.">
		<bitfield id="PWMXBAR29_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR29 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4 20:ADCR0.EVT121:ADCR0.EVT222:ADCR0.EVT323:ADCR0.EVT4 24:ADCR1.EVT125:ADCR1.EVT226:ADCR1.EVT327:ADCR1.EVT42831:ADC_ASC_CHECKEVENT[3:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR29_G4" acronym="CONTROLSS_PWMXBAR29_G4" offset="2128" width="32" description="PWM XBAR 29 Input Select.">
		<bitfield id="PWMXBAR29_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR29 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR29_G5" acronym="CONTROLSS_PWMXBAR29_G5" offset="2132" width="32" description="PWM XBAR 29 Input Select.">
		<bitfield id="PWMXBAR29_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR29 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR29_G6" acronym="CONTROLSS_PWMXBAR29_G6" offset="2136" width="32" description="PWM XBAR 29 Input Select.">
		<bitfield id="PWMXBAR29_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR29 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR29_G7" acronym="CONTROLSS_PWMXBAR29_G7" offset="2140" width="32" description="PWM XBAR 29 Input Select.">
		<bitfield id="PWMXBAR29_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR29 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR29_G8" acronym="CONTROLSS_PWMXBAR29_G8" offset="2144" width="32" description="PWM XBAR 29 Input Select.">
		<bitfield id="PWMXBAR29_G8_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR29 G8 Input SelectBit0:EQEP0.ERRBit1:EQEP1.ERRBit2:EQEP2.ERRBit [6:3]: FSIRX0.RX_TRIG4Bit [10:7]: FSIRX1.RX_TRIG4Bit [14:11]: FSIRX2.RX_TRIG4Bit [18:15]: FSIRX3.RX_TRIG4  Bit [31:19]: ECAP[12:0].TRIPOUT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR29_G9" acronym="CONTROLSS_PWMXBAR29_G9" offset="2148" width="32" description="PWM XBAR 29 Input Select.">
		<bitfield id="PWMXBAR29_G9_SEL" width="7" begin="6" end="0" resetval="0x0" description="PWM XBAR29 G9 Input Select20:ECAP[15:13].TRIPOUT3:SYNCOUTXBAR04:SYNCOUTXBAR15:SOC_A_SEL6:SOC_B_SEL" range="6:0" rwaccess="R/W"/>
	</register>
</module>